In [3]:
 
 (select max(salary) as max_salary,min(salary) as min_salary,avg(salary) as avg_salary from employees)

max_salary,min_salary,avg_salary
24000.00,2500.00,8060.000000

In [4]:
 
select  sum(salary),department_id from employees group by department_id

(No column name),department_id
4400.00,1
19000.00,2
24900.00,3
6500.00,4
41200.00,5
28800.00,6
10000.00,7
57700.00,8
58000.00,9
51600.00,10
20300.00,11

In [5]:

select department_id, count(employee_id)as no_employees from employees group by department_id

department_id,no_employees
1,1
2,2
3,6
4,1
5,7
6,5
7,1
8,6
9,3
10,6
11,2

In [7]:

select  department_id,sum(salary) as total_salary from employees group by department_id

department_id,total_salary
1,4400.00
2,19000.00
3,24900.00
4,6500.00
5,41200.00
6,28800.00
7,10000.00
8,57700.00
9,58000.00
10,51600.00
11,20300.00

In [8]:

select CONCAT( first_name,last_name) as employee_name, department_id from employees

employee_name,department_id
StevenKing,9
NeenaKochhar,9
LexDe Haan,9
AlexanderHunold,6
BruceErnst,6
DavidAustin,6
ValliPataballa,6
DianaLorentz,6
NancyGreenberg,10
DanielFaviet,10
JohnChen,10
IsmaelSciarra,10
Jose ManuelUrman,10
LuisPopp,10
DenRaphaely,3
AlexanderKhoo,3
ShelliBaida,3
SigalTobias,3
GuyHimuro,3
KarenColmenares,3
MatthewWeiss,5
AdamFripp,5
PayamKaufling,5
ShantaVollman,5
IreneMikkilineni,5
JohnRussell,8
KarenPartners,8
JonathonTaylor,8
JackLivingston,8
KimberelyGrant,8
CharlesJohnson,8
SarahBell,5
BritneyEverett,5
JenniferWhalen,1
MichaelHartstein,2
PatFay,2
SusanMavris,4
HermannBaer,7
ShelleyHiggins,11
WilliamGietz,11

In [10]:

select concat (first_name,last_name) as employee_name ,salary from employees

employee_name,salary
StevenKing,24000.00
NeenaKochhar,17000.00
LexDe Haan,17000.00
AlexanderHunold,9000.00
BruceErnst,6000.00
DavidAustin,4800.00
ValliPataballa,4800.00
DianaLorentz,4200.00
NancyGreenberg,12000.00
DanielFaviet,9000.00
JohnChen,8200.00
IsmaelSciarra,7700.00
Jose ManuelUrman,7800.00
LuisPopp,6900.00
DenRaphaely,11000.00
AlexanderKhoo,3100.00
ShelliBaida,2900.00
SigalTobias,2800.00
GuyHimuro,2600.00
KarenColmenares,2500.00
MatthewWeiss,8000.00
AdamFripp,8200.00
PayamKaufling,7900.00
ShantaVollman,6500.00
IreneMikkilineni,2700.00
JohnRussell,14000.00
KarenPartners,13500.00
JonathonTaylor,8600.00
JackLivingston,8400.00
KimberelyGrant,7000.00
CharlesJohnson,6200.00
SarahBell,4000.00
BritneyEverett,3900.00
JenniferWhalen,4400.00
MichaelHartstein,13000.00
PatFay,6000.00
SusanMavris,6500.00
HermannBaer,10000.00
ShelleyHiggins,12000.00
WilliamGietz,8300.00

In [14]:

SELECT first_name,COUNT(department_id)
FROM Employees GROUP BY first_name
HAVING
COUNT(department_id) > 1

first_name,(No column name)
Alexander,2
John,2
Karen,2

In [15]:

select manager_id ,sum(salary) as total_salary from employees group by manager_id

manager_id,total_salary
NULL,24000.00
100,146300.00
101,44900.00
102,9000.00
103,19800.00
108,39600.00
114,13900.00
120,2700.00
123,7900.00
201,6000.00
205,8300.00

In [17]:

select concat(m.first_name,m.last_name)as EmployeeName,m.department_id,m.salary,w.first_name as manager_name
from employees m,employees w where m.manager_id=w.employee_id and
m.last_name like '_a%'

EmployeeName,department_id,salary,manager_name
ValliPataballa,6,4800.00,Alexander
DanielFaviet,10,9000.00,Nancy
DenRaphaely,3,11000.00,Steven
ShelliBaida,3,2900.00,Den
PayamKaufling,5,7900.00,Steven
KarenPartners,8,13500.00,Steven
JonathonTaylor,8,8600.00,Steven
MichaelHartstein,2,13000.00,Steven
PatFay,2,6000.00,Michael
SusanMavris,4,6500.00,Neena
HermannBaer,7,10000.00,Neena

In [18]:

select department_id,avg(salary)as AvgSalary from dbo.employees group by department_id  order by department_id

department_id,AvgSalary
1,4400.000000
2,9500.000000
3,4150.000000
4,6500.000000
5,5885.714285
6,5760.000000
7,10000.000000
8,9616.666666
9,19333.333333
10,8600.000000
11,10150.000000

In [19]:

select department_id,max(salary)as MaxSalary from employees group by department_id

department_id,MaxSalary
1,4400.00
2,13000.00
3,11000.00
4,6500.00
5,8200.00
6,9000.00
7,10000.00
8,14000.00
9,24000.00
10,12000.00
11,12000.00